Cone_Supersonic/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include         "include/freestreamConditions"
dimensions      [0 1 -1 0 0 0 0];


internalField   uniform $U;

boundaryField
{
    inlet
    {
        type            characteristicFarfieldVelocity;
        #include        "include/freestreamConditions"
        value           uniform (0 0 0);
    }
    outlet
    {
        type            characteristicFarfieldVelocity;
        #include        "include/freestreamConditions"
        value           uniform (0 0 0);
    }
    cone
    {
        type            slip;
    }
    top_bot
    {
        type            characteristicFarfieldVelocity;
        #include        "include/freestreamConditions"
        value           uniform (0 0 0);
    }
    syms
    {
        type            symmetry;
    }
}


// ************************************************************************* //
