Cone_Supersonic/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include         "include/freestreamConditions"
dimensions      [0 0 0 1 0 0 0];


internalField   uniform $T;

boundaryField
{
    inlet
    {
        type            characteristicFarfieldTemperature;
        #include        "include/freestreamConditions"
        value           $internalField;
    }
    outlet
    {
        type            characteristicFarfieldTemperature;
        #include        "include/freestreamConditions"
        value           $internalField;
    }
    cone
    {
        type            characteristicWallTemperature;
        value           $internalField;
    }
    top_bot
    {
        type            characteristicFarfieldTemperature;
        #include        "include/freestreamConditions"
        value           $internalField;
    }
    syms
    {
        type            symmetry;
    }
}


// ************************************************************************* //
